Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договоры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИтого</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаИтогоПрописью</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабНоменклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПересчетТЧ(Элемент)
    // Правильно передаем текущую строку табличной части
    РаботаСДокументами.РассчитатьСумму(Элементы.ТабНоменклатура.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТабНоменклатураПриИзменении(Элемент)
    // Пересчитываем итоговую сумму
    Объект.СуммаИтого = Объект.ТабНоменклатура.Итог("Сумма");
    
    // Получаем сумму прописью и присваиваем реквизиту формы
    Объект.СуммаИтогоПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаИтого);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    // Инициализируем при открытии формы
    Объект.СуммаИтого = Объект.ТабНоменклатура.Итог("Сумма");
    Объект.СуммаИтогоПрописью = РаботаСДокументами.ИтоговоеЧислоПрописью(Объект.СуммаИтого);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
    // Проверяем, является ли выбранный контрагент поставщиком
    Если НЕ ПроверкаКонтрагента(Объект.Контрагент) Тогда
        ТекстСообщения = "Выбранный контрагент не является поставщиком!
        |Очистить поле Контрагент?";
        Режим = РежимДиалогаВопрос.ДаНет;
        Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
        ПоказатьВопрос(Оповещение, ТекстСообщения, Режим);
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    // Обрабатываем ответ пользователя на вопрос об очистке контрагента
    Если Результат = КодВозвратаДиалога.Да Тогда
        Объект.Контрагент = Неопределено;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверкаКонтрагента(ВыбКонтрагент)
    // Проверяем, что контрагент выбран и является поставщиком     
	
    // Если контрагент не выбран - сразу возвращаем Ложь
    Если ВыбКонтрагент = Неопределено Тогда
        Возврат Ложь;
    КонецЕсли;

	// Проверяем свойство контрагента "ЭтоПоставщик"
    Возврат ВыбКонтрагент.ЭтоПоставщик;
КонецФункции
